zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/dacc.h
/**
 * \brief Component description for PIC32CZ/CA70 DACC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_DACC_COMPONENT_H_
#define _PIC32CZ_CA70_DACC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_DACC Digital-to-Analog Converter Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR DACC */
/* ========================================================================== */

/* -------- DACC_CR : (DACC Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t SWRST:1;                   /**< bit:      0  Software Reset                                */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_CR_bits_t;

#define DACC_CR_SWRST_Pos                     (0)                                            /**< (DACC_CR) Software Reset Position */
#define DACC_CR_SWRST_Msk                     (0x1U << DACC_CR_SWRST_Pos)                    /**< (DACC_CR) Software Reset Mask */
#define DACC_CR_Msk                           (0x00000001UL)                                 /**< (DACC_CR) Register Mask  */

/* -------- DACC_MR : (DACC Offset: 0x04) (R/W 32) Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t MAXS0:1;                   /**< bit:      0  Max Speed Mode for Channel 0                  */
    uint32_t MAXS1:1;                   /**< bit:      1  Max Speed Mode for Channel 1                  */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t WORD:1;                    /**< bit:      4  Word Transfer Mode                            */
    uint32_t ZERO:1;                    /**< bit:      5  Must always be written to 0.                  */
    uint32_t :17;                       /**< bit:  6..22  Reserved                                      */
    uint32_t DIFF:1;                    /**< bit:     23  Differential Mode                             */
    uint32_t PRESCALER:4;               /**< bit: 24..27  Peripheral Clock to DAC Clock Ratio           */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  struct
  {
    uint32_t MAXS:2;                    /**< bit:   0..1  Max Speed Mode for Channel x                  */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_MR_bits_t;

#define DACC_MR_MAXS0_Pos                     (0)                                            /**< (DACC_MR) Max Speed Mode for Channel 0 Position */
#define DACC_MR_MAXS0_Msk                     (0x1U << DACC_MR_MAXS0_Pos)                    /**< (DACC_MR) Max Speed Mode for Channel 0 Mask */
#define   DACC_MR_MAXS0_TRIG_EVENT_Val        (0x0U)                                         /**< (DACC_MR) Trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)  */
#define   DACC_MR_MAXS0_MAXIMUM_Val           (0x1U)                                         /**< (DACC_MR) Max speed mode enabled.  */
#define DACC_MR_MAXS0_TRIG_EVENT              (DACC_MR_MAXS0_TRIG_EVENT_Val << DACC_MR_MAXS0_Pos)  /**< (DACC_MR) Trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.) Position  */
#define DACC_MR_MAXS0_MAXIMUM                 (DACC_MR_MAXS0_MAXIMUM_Val << DACC_MR_MAXS0_Pos)  /**< (DACC_MR) Max speed mode enabled. Position  */
#define DACC_MR_MAXS1_Pos                     (1)                                            /**< (DACC_MR) Max Speed Mode for Channel 1 Position */
#define DACC_MR_MAXS1_Msk                     (0x1U << DACC_MR_MAXS1_Pos)                    /**< (DACC_MR) Max Speed Mode for Channel 1 Mask */
#define   DACC_MR_MAXS1_TRIG_EVENT_Val        (0x0U)                                         /**< (DACC_MR) Trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.)  */
#define   DACC_MR_MAXS1_MAXIMUM_Val           (0x1U)                                         /**< (DACC_MR) Max speed mode enabled.  */
#define DACC_MR_MAXS1_TRIG_EVENT              (DACC_MR_MAXS1_TRIG_EVENT_Val << DACC_MR_MAXS1_Pos)  /**< (DACC_MR) Trigger mode or Free-running mode enabled. (See TRGENx.DACC_TRIGR.) Position  */
#define DACC_MR_MAXS1_MAXIMUM                 (DACC_MR_MAXS1_MAXIMUM_Val << DACC_MR_MAXS1_Pos)  /**< (DACC_MR) Max speed mode enabled. Position  */
#define DACC_MR_WORD_Pos                      (4)                                            /**< (DACC_MR) Word Transfer Mode Position */
#define DACC_MR_WORD_Msk                      (0x1U << DACC_MR_WORD_Pos)                     /**< (DACC_MR) Word Transfer Mode Mask */
#define   DACC_MR_WORD_DISABLED_Val           (0x0U)                                         /**< (DACC_MR) One data to convert is written to the FIFO per access to DACC.  */
#define   DACC_MR_WORD_ENABLED_Val            (0x1U)                                         /**< (DACC_MR) Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses).  */
#define DACC_MR_WORD_DISABLED                 (DACC_MR_WORD_DISABLED_Val << DACC_MR_WORD_Pos)  /**< (DACC_MR) One data to convert is written to the FIFO per access to DACC. Position  */
#define DACC_MR_WORD_ENABLED                  (DACC_MR_WORD_ENABLED_Val << DACC_MR_WORD_Pos)  /**< (DACC_MR) Two data to convert are written to the FIFO per access to DACC (reduces the number of requests to DMA and the number of system bus accesses). Position  */
#define DACC_MR_ZERO_Pos                      (5)                                            /**< (DACC_MR) Must always be written to 0. Position */
#define DACC_MR_ZERO_Msk                      (0x1U << DACC_MR_ZERO_Pos)                     /**< (DACC_MR) Must always be written to 0. Mask */
#define DACC_MR_DIFF_Pos                      (23)                                           /**< (DACC_MR) Differential Mode Position */
#define DACC_MR_DIFF_Msk                      (0x1U << DACC_MR_DIFF_Pos)                     /**< (DACC_MR) Differential Mode Mask */
#define   DACC_MR_DIFF_DISABLED_Val           (0x0U)                                         /**< (DACC_MR) DAC0 and DAC1 are single-ended outputs.  */
#define   DACC_MR_DIFF_ENABLED_Val            (0x1U)                                         /**< (DACC_MR) DACP and DACN are differential outputs. The differential level is configured by the channel 0 value.  */
#define DACC_MR_DIFF_DISABLED                 (DACC_MR_DIFF_DISABLED_Val << DACC_MR_DIFF_Pos)  /**< (DACC_MR) DAC0 and DAC1 are single-ended outputs. Position  */
#define DACC_MR_DIFF_ENABLED                  (DACC_MR_DIFF_ENABLED_Val << DACC_MR_DIFF_Pos)  /**< (DACC_MR) DACP and DACN are differential outputs. The differential level is configured by the channel 0 value. Position  */
#define DACC_MR_PRESCALER_Pos                 (24)                                           /**< (DACC_MR) Peripheral Clock to DAC Clock Ratio Position */
#define DACC_MR_PRESCALER_Msk                 (0xFU << DACC_MR_PRESCALER_Pos)                /**< (DACC_MR) Peripheral Clock to DAC Clock Ratio Mask */
#define DACC_MR_PRESCALER(value)              (DACC_MR_PRESCALER_Msk & ((value) << DACC_MR_PRESCALER_Pos))
#define DACC_MR_Msk                           (0x0F800033UL)                                 /**< (DACC_MR) Register Mask  */
#define DACC_MR_MAXS_Pos                      (0)                                            /**< (DACC_MR Position) Max Speed Mode for Channel x */
#define DACC_MR_MAXS_Msk                      (0x3U << DACC_MR_MAXS_Pos)                     /**< (DACC_MR Mask) MAXS */
#define DACC_MR_MAXS(value)                   (DACC_MR_MAXS_Msk & ((value) << DACC_MR_MAXS_Pos))

/* -------- DACC_TRIGR : (DACC Offset: 0x08) (R/W 32) Trigger Register -------- */

typedef union
{
  struct
  {
    uint32_t TRGEN0:1;                  /**< bit:      0  Trigger Enable of Channel 0                   */
    uint32_t TRGEN1:1;                  /**< bit:      1  Trigger Enable of Channel 1                   */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t TRGSEL0:3;                 /**< bit:   4..6  Trigger Selection of Channel 0                */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t TRGSEL1:3;                 /**< bit:  8..10  Trigger Selection of Channel 1                */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t OSR0:3;                    /**< bit: 16..18  Over Sampling Ratio of Channel 0              */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t OSR1:3;                    /**< bit: 20..22  Over Sampling Ratio of Channel 1              */
    uint32_t :9;                        /**< bit: 23..31  Reserved                                      */
  };
  struct
  {
    uint32_t TRGEN:2;                   /**< bit:   0..1  Trigger Enable of Channel x                   */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_TRIGR_bits_t;

#define DACC_TRIGR_TRGEN0_Pos                 (0)                                            /**< (DACC_TRIGR) Trigger Enable of Channel 0 Position */
#define DACC_TRIGR_TRGEN0_Msk                 (0x1U << DACC_TRIGR_TRGEN0_Pos)                /**< (DACC_TRIGR) Trigger Enable of Channel 0 Mask */
#define   DACC_TRIGR_TRGEN0_DIS_Val           (0x0U)                                         /**< (DACC_TRIGR) Trigger mode disabled. DACC is in Free-running mode or Max speed mode.  */
#define   DACC_TRIGR_TRGEN0_EN_Val            (0x1U)                                         /**< (DACC_TRIGR) Trigger mode enabled.  */
#define DACC_TRIGR_TRGEN0_DIS                 (DACC_TRIGR_TRGEN0_DIS_Val << DACC_TRIGR_TRGEN0_Pos)  /**< (DACC_TRIGR) Trigger mode disabled. DACC is in Free-running mode or Max speed mode. Position  */
#define DACC_TRIGR_TRGEN0_EN                  (DACC_TRIGR_TRGEN0_EN_Val << DACC_TRIGR_TRGEN0_Pos)  /**< (DACC_TRIGR) Trigger mode enabled. Position  */
#define DACC_TRIGR_TRGEN1_Pos                 (1)                                            /**< (DACC_TRIGR) Trigger Enable of Channel 1 Position */
#define DACC_TRIGR_TRGEN1_Msk                 (0x1U << DACC_TRIGR_TRGEN1_Pos)                /**< (DACC_TRIGR) Trigger Enable of Channel 1 Mask */
#define   DACC_TRIGR_TRGEN1_DIS_Val           (0x0U)                                         /**< (DACC_TRIGR) Trigger mode disabled. DACC is in Free-running mode or Max speed mode.  */
#define   DACC_TRIGR_TRGEN1_EN_Val            (0x1U)                                         /**< (DACC_TRIGR) Trigger mode enabled.  */
#define DACC_TRIGR_TRGEN1_DIS                 (DACC_TRIGR_TRGEN1_DIS_Val << DACC_TRIGR_TRGEN1_Pos)  /**< (DACC_TRIGR) Trigger mode disabled. DACC is in Free-running mode or Max speed mode. Position  */
#define DACC_TRIGR_TRGEN1_EN                  (DACC_TRIGR_TRGEN1_EN_Val << DACC_TRIGR_TRGEN1_Pos)  /**< (DACC_TRIGR) Trigger mode enabled. Position  */
#define DACC_TRIGR_TRGSEL0_Pos                (4)                                            /**< (DACC_TRIGR) Trigger Selection of Channel 0 Position */
#define DACC_TRIGR_TRGSEL0_Msk                (0x7U << DACC_TRIGR_TRGSEL0_Pos)               /**< (DACC_TRIGR) Trigger Selection of Channel 0 Mask */
#define DACC_TRIGR_TRGSEL0(value)             (DACC_TRIGR_TRGSEL0_Msk & ((value) << DACC_TRIGR_TRGSEL0_Pos))
#define   DACC_TRIGR_TRGSEL0_TRGSEL0_Val      (0x0U)                                         /**< (DACC_TRIGR) DATRG  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL1_Val      (0x1U)                                         /**< (DACC_TRIGR) TC0 output  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL2_Val      (0x2U)                                         /**< (DACC_TRIGR) TC1 output  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL3_Val      (0x3U)                                         /**< (DACC_TRIGR) TC2 output  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL4_Val      (0x4U)                                         /**< (DACC_TRIGR) PWM0 event 0  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL5_Val      (0x5U)                                         /**< (DACC_TRIGR) PWM0 event 1  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL6_Val      (0x6U)                                         /**< (DACC_TRIGR) PWM1 event 0  */
#define   DACC_TRIGR_TRGSEL0_TRGSEL7_Val      (0x7U)                                         /**< (DACC_TRIGR) PWM1 event 1  */
#define DACC_TRIGR_TRGSEL0_TRGSEL0            (DACC_TRIGR_TRGSEL0_TRGSEL0_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) DATRG Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL1            (DACC_TRIGR_TRGSEL0_TRGSEL1_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) TC0 output Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL2            (DACC_TRIGR_TRGSEL0_TRGSEL2_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) TC1 output Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL3            (DACC_TRIGR_TRGSEL0_TRGSEL3_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) TC2 output Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL4            (DACC_TRIGR_TRGSEL0_TRGSEL4_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM0 event 0 Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL5            (DACC_TRIGR_TRGSEL0_TRGSEL5_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM0 event 1 Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL6            (DACC_TRIGR_TRGSEL0_TRGSEL6_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM1 event 0 Position  */
#define DACC_TRIGR_TRGSEL0_TRGSEL7            (DACC_TRIGR_TRGSEL0_TRGSEL7_Val << DACC_TRIGR_TRGSEL0_Pos)  /**< (DACC_TRIGR) PWM1 event 1 Position  */
#define DACC_TRIGR_TRGSEL1_Pos                (8)                                            /**< (DACC_TRIGR) Trigger Selection of Channel 1 Position */
#define DACC_TRIGR_TRGSEL1_Msk                (0x7U << DACC_TRIGR_TRGSEL1_Pos)               /**< (DACC_TRIGR) Trigger Selection of Channel 1 Mask */
#define DACC_TRIGR_TRGSEL1(value)             (DACC_TRIGR_TRGSEL1_Msk & ((value) << DACC_TRIGR_TRGSEL1_Pos))
#define   DACC_TRIGR_TRGSEL1_TRGSEL0_Val      (0x0U)                                         /**< (DACC_TRIGR) DATRG  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL1_Val      (0x1U)                                         /**< (DACC_TRIGR) TC0 output  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL2_Val      (0x2U)                                         /**< (DACC_TRIGR) TC1 output  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL3_Val      (0x3U)                                         /**< (DACC_TRIGR) TC2 output  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL4_Val      (0x4U)                                         /**< (DACC_TRIGR) PWM0 event 0  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL5_Val      (0x5U)                                         /**< (DACC_TRIGR) PWM0 event 1  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL6_Val      (0x6U)                                         /**< (DACC_TRIGR) PWM1 event 0  */
#define   DACC_TRIGR_TRGSEL1_TRGSEL7_Val      (0x7U)                                         /**< (DACC_TRIGR) PWM1 event 1  */
#define DACC_TRIGR_TRGSEL1_TRGSEL0            (DACC_TRIGR_TRGSEL1_TRGSEL0_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) DATRG Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL1            (DACC_TRIGR_TRGSEL1_TRGSEL1_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) TC0 output Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL2            (DACC_TRIGR_TRGSEL1_TRGSEL2_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) TC1 output Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL3            (DACC_TRIGR_TRGSEL1_TRGSEL3_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) TC2 output Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL4            (DACC_TRIGR_TRGSEL1_TRGSEL4_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM0 event 0 Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL5            (DACC_TRIGR_TRGSEL1_TRGSEL5_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM0 event 1 Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL6            (DACC_TRIGR_TRGSEL1_TRGSEL6_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM1 event 0 Position  */
#define DACC_TRIGR_TRGSEL1_TRGSEL7            (DACC_TRIGR_TRGSEL1_TRGSEL7_Val << DACC_TRIGR_TRGSEL1_Pos)  /**< (DACC_TRIGR) PWM1 event 1 Position  */
#define DACC_TRIGR_OSR0_Pos                   (16)                                           /**< (DACC_TRIGR) Over Sampling Ratio of Channel 0 Position */
#define DACC_TRIGR_OSR0_Msk                   (0x7U << DACC_TRIGR_OSR0_Pos)                  /**< (DACC_TRIGR) Over Sampling Ratio of Channel 0 Mask */
#define DACC_TRIGR_OSR0(value)                (DACC_TRIGR_OSR0_Msk & ((value) << DACC_TRIGR_OSR0_Pos))
#define   DACC_TRIGR_OSR0_OSR_1_Val           (0x0U)                                         /**< (DACC_TRIGR) OSR = 1  */
#define   DACC_TRIGR_OSR0_OSR_2_Val           (0x1U)                                         /**< (DACC_TRIGR) OSR = 2  */
#define   DACC_TRIGR_OSR0_OSR_4_Val           (0x2U)                                         /**< (DACC_TRIGR) OSR = 4  */
#define   DACC_TRIGR_OSR0_OSR_8_Val           (0x3U)                                         /**< (DACC_TRIGR) OSR = 8  */
#define   DACC_TRIGR_OSR0_OSR_16_Val          (0x4U)                                         /**< (DACC_TRIGR) OSR = 16  */
#define   DACC_TRIGR_OSR0_OSR_32_Val          (0x5U)                                         /**< (DACC_TRIGR) OSR = 32  */
#define DACC_TRIGR_OSR0_OSR_1                 (DACC_TRIGR_OSR0_OSR_1_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 1 Position  */
#define DACC_TRIGR_OSR0_OSR_2                 (DACC_TRIGR_OSR0_OSR_2_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 2 Position  */
#define DACC_TRIGR_OSR0_OSR_4                 (DACC_TRIGR_OSR0_OSR_4_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 4 Position  */
#define DACC_TRIGR_OSR0_OSR_8                 (DACC_TRIGR_OSR0_OSR_8_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 8 Position  */
#define DACC_TRIGR_OSR0_OSR_16                (DACC_TRIGR_OSR0_OSR_16_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 16 Position  */
#define DACC_TRIGR_OSR0_OSR_32                (DACC_TRIGR_OSR0_OSR_32_Val << DACC_TRIGR_OSR0_Pos)  /**< (DACC_TRIGR) OSR = 32 Position  */
#define DACC_TRIGR_OSR1_Pos                   (20)                                           /**< (DACC_TRIGR) Over Sampling Ratio of Channel 1 Position */
#define DACC_TRIGR_OSR1_Msk                   (0x7U << DACC_TRIGR_OSR1_Pos)                  /**< (DACC_TRIGR) Over Sampling Ratio of Channel 1 Mask */
#define DACC_TRIGR_OSR1(value)                (DACC_TRIGR_OSR1_Msk & ((value) << DACC_TRIGR_OSR1_Pos))
#define   DACC_TRIGR_OSR1_OSR_1_Val           (0x0U)                                         /**< (DACC_TRIGR) OSR = 1  */
#define   DACC_TRIGR_OSR1_OSR_2_Val           (0x1U)                                         /**< (DACC_TRIGR) OSR = 2  */
#define   DACC_TRIGR_OSR1_OSR_4_Val           (0x2U)                                         /**< (DACC_TRIGR) OSR = 4  */
#define   DACC_TRIGR_OSR1_OSR_8_Val           (0x3U)                                         /**< (DACC_TRIGR) OSR = 8  */
#define   DACC_TRIGR_OSR1_OSR_16_Val          (0x4U)                                         /**< (DACC_TRIGR) OSR = 16  */
#define   DACC_TRIGR_OSR1_OSR_32_Val          (0x5U)                                         /**< (DACC_TRIGR) OSR = 32  */
#define DACC_TRIGR_OSR1_OSR_1                 (DACC_TRIGR_OSR1_OSR_1_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 1 Position  */
#define DACC_TRIGR_OSR1_OSR_2                 (DACC_TRIGR_OSR1_OSR_2_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 2 Position  */
#define DACC_TRIGR_OSR1_OSR_4                 (DACC_TRIGR_OSR1_OSR_4_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 4 Position  */
#define DACC_TRIGR_OSR1_OSR_8                 (DACC_TRIGR_OSR1_OSR_8_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 8 Position  */
#define DACC_TRIGR_OSR1_OSR_16                (DACC_TRIGR_OSR1_OSR_16_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 16 Position  */
#define DACC_TRIGR_OSR1_OSR_32                (DACC_TRIGR_OSR1_OSR_32_Val << DACC_TRIGR_OSR1_Pos)  /**< (DACC_TRIGR) OSR = 32 Position  */
#define DACC_TRIGR_Msk                        (0x00770773UL)                                 /**< (DACC_TRIGR) Register Mask  */
#define DACC_TRIGR_TRGEN_Pos                  (0)                                            /**< (DACC_TRIGR Position) Trigger Enable of Channel x */
#define DACC_TRIGR_TRGEN_Msk                  (0x3U << DACC_TRIGR_TRGEN_Pos)                 /**< (DACC_TRIGR Mask) TRGEN */
#define DACC_TRIGR_TRGEN(value)               (DACC_TRIGR_TRGEN_Msk & ((value) << DACC_TRIGR_TRGEN_Pos))

