zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/dacc.h
/* -------- DACC_CHER : (DACC Offset: 0x10) (/W 32) Channel Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Enable                              */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Enable                              */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  struct
  {
    uint32_t CH:2;                      /**< bit:   0..1  Channel x Enable                              */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_CHER_bits_t;

#define DACC_CHER_CH0_Pos                     (0)                                            /**< (DACC_CHER) Channel 0 Enable Position */
#define DACC_CHER_CH0_Msk                     (0x1U << DACC_CHER_CH0_Pos)                    /**< (DACC_CHER) Channel 0 Enable Mask */
#define DACC_CHER_CH1_Pos                     (1)                                            /**< (DACC_CHER) Channel 1 Enable Position */
#define DACC_CHER_CH1_Msk                     (0x1U << DACC_CHER_CH1_Pos)                    /**< (DACC_CHER) Channel 1 Enable Mask */
#define DACC_CHER_Msk                         (0x00000003UL)                                 /**< (DACC_CHER) Register Mask  */
#define DACC_CHER_CH_Pos                      (0)                                            /**< (DACC_CHER Position) Channel x Enable */
#define DACC_CHER_CH_Msk                      (0x3U << DACC_CHER_CH_Pos)                     /**< (DACC_CHER Mask) CH */
#define DACC_CHER_CH(value)                   (DACC_CHER_CH_Msk & ((value) << DACC_CHER_CH_Pos))

/* -------- DACC_CHDR : (DACC Offset: 0x14) (/W 32) Channel Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Disable                             */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Disable                             */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  struct
  {
    uint32_t CH:2;                      /**< bit:   0..1  Channel x Disable                             */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_CHDR_bits_t;

#define DACC_CHDR_CH0_Pos                     (0)                                            /**< (DACC_CHDR) Channel 0 Disable Position */
#define DACC_CHDR_CH0_Msk                     (0x1U << DACC_CHDR_CH0_Pos)                    /**< (DACC_CHDR) Channel 0 Disable Mask */
#define DACC_CHDR_CH1_Pos                     (1)                                            /**< (DACC_CHDR) Channel 1 Disable Position */
#define DACC_CHDR_CH1_Msk                     (0x1U << DACC_CHDR_CH1_Pos)                    /**< (DACC_CHDR) Channel 1 Disable Mask */
#define DACC_CHDR_Msk                         (0x00000003UL)                                 /**< (DACC_CHDR) Register Mask  */
#define DACC_CHDR_CH_Pos                      (0)                                            /**< (DACC_CHDR Position) Channel x Disable */
#define DACC_CHDR_CH_Msk                      (0x3U << DACC_CHDR_CH_Pos)                     /**< (DACC_CHDR Mask) CH */
#define DACC_CHDR_CH(value)                   (DACC_CHDR_CH_Msk & ((value) << DACC_CHDR_CH_Pos))

/* -------- DACC_CHSR : (DACC Offset: 0x18) (R/ 32) Channel Status Register -------- */

typedef union
{
  struct
  {
    uint32_t CH0:1;                     /**< bit:      0  Channel 0 Status                              */
    uint32_t CH1:1;                     /**< bit:      1  Channel 1 Status                              */
    uint32_t :6;                        /**< bit:   2..7  Reserved                                      */
    uint32_t DACRDY0:1;                 /**< bit:      8  DAC Ready Flag                                */
    uint32_t DACRDY1:1;                 /**< bit:      9  DAC Ready Flag                                */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  struct
  {
    uint32_t CH:2;                      /**< bit:   0..1  Channel x Status                              */
    uint32_t :6;                        /**< bit:   2..7  Reserved                                      */
    uint32_t DACRDY:2;                  /**< bit:   8..9  DAC Ready Flag                                */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_CHSR_bits_t;

#define DACC_CHSR_CH0_Pos                     (0)                                            /**< (DACC_CHSR) Channel 0 Status Position */
#define DACC_CHSR_CH0_Msk                     (0x1U << DACC_CHSR_CH0_Pos)                    /**< (DACC_CHSR) Channel 0 Status Mask */
#define DACC_CHSR_CH1_Pos                     (1)                                            /**< (DACC_CHSR) Channel 1 Status Position */
#define DACC_CHSR_CH1_Msk                     (0x1U << DACC_CHSR_CH1_Pos)                    /**< (DACC_CHSR) Channel 1 Status Mask */
#define DACC_CHSR_DACRDY0_Pos                 (8)                                            /**< (DACC_CHSR) DAC Ready Flag Position */
#define DACC_CHSR_DACRDY0_Msk                 (0x1U << DACC_CHSR_DACRDY0_Pos)                /**< (DACC_CHSR) DAC Ready Flag Mask */
#define DACC_CHSR_DACRDY1_Pos                 (9)                                            /**< (DACC_CHSR) DAC Ready Flag Position */
#define DACC_CHSR_DACRDY1_Msk                 (0x1U << DACC_CHSR_DACRDY1_Pos)                /**< (DACC_CHSR) DAC Ready Flag Mask */
#define DACC_CHSR_Msk                         (0x00000303UL)                                 /**< (DACC_CHSR) Register Mask  */
#define DACC_CHSR_CH_Pos                      (0)                                            /**< (DACC_CHSR Position) Channel x Status */
#define DACC_CHSR_CH_Msk                      (0x3U << DACC_CHSR_CH_Pos)                     /**< (DACC_CHSR Mask) CH */
#define DACC_CHSR_CH(value)                   (DACC_CHSR_CH_Msk & ((value) << DACC_CHSR_CH_Pos))
#define DACC_CHSR_DACRDY_Pos                  (8)                                            /**< (DACC_CHSR Position) DAC Ready Flag */
#define DACC_CHSR_DACRDY_Msk                  (0x3U << DACC_CHSR_DACRDY_Pos)                 /**< (DACC_CHSR Mask) DACRDY */
#define DACC_CHSR_DACRDY(value)               (DACC_CHSR_DACRDY_Msk & ((value) << DACC_CHSR_DACRDY_Pos))

