zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/dacc.h
/* -------- DACC_CDR : (DACC Offset: 0x1c) (/W 32) Conversion Data Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t DATA0:16;                  /**< bit:  0..15  Data to Convert for channel 0                 */
    uint32_t DATA1:16;                  /**< bit: 16..31  Data to Convert for channel 1                 */
  };
  uint32_t w;
} __DACC_CDR_bits_t;

#define DACC_CDR_DATA0_Pos                    (0)                                            /**< (DACC_CDR) Data to Convert for channel 0 Position */
#define DACC_CDR_DATA0_Msk                    (0xFFFFU << DACC_CDR_DATA0_Pos)                /**< (DACC_CDR) Data to Convert for channel 0 Mask */
#define DACC_CDR_DATA0(value)                 (DACC_CDR_DATA0_Msk & ((value) << DACC_CDR_DATA0_Pos))
#define DACC_CDR_DATA1_Pos                    (16)                                           /**< (DACC_CDR) Data to Convert for channel 1 Position */
#define DACC_CDR_DATA1_Msk                    (0xFFFFU << DACC_CDR_DATA1_Pos)                /**< (DACC_CDR) Data to Convert for channel 1 Mask */
#define DACC_CDR_DATA1(value)                 (DACC_CDR_DATA1_Msk & ((value) << DACC_CDR_DATA1_Pos))
#define DACC_CDR_Msk                          (0xFFFFFFFFUL)                                 /**< (DACC_CDR) Register Mask  */

/* -------- DACC_IER : (DACC Offset: 0x24) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Enable of channel 0  */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Enable of channel 1  */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Enable of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Enable of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  struct
  {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Enable of channel x  */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Enable of channel x */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_IER_bits_t;

#define DACC_IER_TXRDY0_Pos                   (0)                                            /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 0 Position */
#define DACC_IER_TXRDY0_Msk                   (0x1U << DACC_IER_TXRDY0_Pos)                  /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 0 Mask */
#define DACC_IER_TXRDY1_Pos                   (1)                                            /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 1 Position */
#define DACC_IER_TXRDY1_Msk                   (0x1U << DACC_IER_TXRDY1_Pos)                  /**< (DACC_IER) Transmit Ready Interrupt Enable of channel 1 Mask */
#define DACC_IER_EOC0_Pos                     (4)                                            /**< (DACC_IER) End of Conversion Interrupt Enable of channel 0 Position */
#define DACC_IER_EOC0_Msk                     (0x1U << DACC_IER_EOC0_Pos)                    /**< (DACC_IER) End of Conversion Interrupt Enable of channel 0 Mask */
#define DACC_IER_EOC1_Pos                     (5)                                            /**< (DACC_IER) End of Conversion Interrupt Enable of channel 1 Position */
#define DACC_IER_EOC1_Msk                     (0x1U << DACC_IER_EOC1_Pos)                    /**< (DACC_IER) End of Conversion Interrupt Enable of channel 1 Mask */
#define DACC_IER_Msk                          (0x00000033UL)                                 /**< (DACC_IER) Register Mask  */
#define DACC_IER_TXRDY_Pos                    (0)                                            /**< (DACC_IER Position) Transmit Ready Interrupt Enable of channel x */
#define DACC_IER_TXRDY_Msk                    (0x3U << DACC_IER_TXRDY_Pos)                   /**< (DACC_IER Mask) TXRDY */
#define DACC_IER_TXRDY(value)                 (DACC_IER_TXRDY_Msk & ((value) << DACC_IER_TXRDY_Pos))
#define DACC_IER_EOC_Pos                      (4)                                            /**< (DACC_IER Position) End of Conversion Interrupt Enable of channel x */
#define DACC_IER_EOC_Msk                      (0x3U << DACC_IER_EOC_Pos)                     /**< (DACC_IER Mask) EOC */
#define DACC_IER_EOC(value)                   (DACC_IER_EOC_Msk & ((value) << DACC_IER_EOC_Pos))

/* -------- DACC_IDR : (DACC Offset: 0x28) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Disable of channel 0 */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Disable of channel 1 */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Disable of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Disable of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  struct
  {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Disable of channel x */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Disable of channel x */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_IDR_bits_t;

#define DACC_IDR_TXRDY0_Pos                   (0)                                            /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 0 Position */
#define DACC_IDR_TXRDY0_Msk                   (0x1U << DACC_IDR_TXRDY0_Pos)                  /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 0 Mask */
#define DACC_IDR_TXRDY1_Pos                   (1)                                            /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 1 Position */
#define DACC_IDR_TXRDY1_Msk                   (0x1U << DACC_IDR_TXRDY1_Pos)                  /**< (DACC_IDR) Transmit Ready Interrupt Disable of channel 1 Mask */
#define DACC_IDR_EOC0_Pos                     (4)                                            /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 0 Position */
#define DACC_IDR_EOC0_Msk                     (0x1U << DACC_IDR_EOC0_Pos)                    /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 0 Mask */
#define DACC_IDR_EOC1_Pos                     (5)                                            /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 1 Position */
#define DACC_IDR_EOC1_Msk                     (0x1U << DACC_IDR_EOC1_Pos)                    /**< (DACC_IDR) End of Conversion Interrupt Disable of channel 1 Mask */
#define DACC_IDR_Msk                          (0x00000033UL)                                 /**< (DACC_IDR) Register Mask  */
#define DACC_IDR_TXRDY_Pos                    (0)                                            /**< (DACC_IDR Position) Transmit Ready Interrupt Disable of channel x */
#define DACC_IDR_TXRDY_Msk                    (0x3U << DACC_IDR_TXRDY_Pos)                   /**< (DACC_IDR Mask) TXRDY */
#define DACC_IDR_TXRDY(value)                 (DACC_IDR_TXRDY_Msk & ((value) << DACC_IDR_TXRDY_Pos))
#define DACC_IDR_EOC_Pos                      (4)                                            /**< (DACC_IDR Position) End of Conversion Interrupt Disable of channel x */
#define DACC_IDR_EOC_Msk                      (0x3U << DACC_IDR_EOC_Pos)                     /**< (DACC_IDR Mask) EOC */
#define DACC_IDR_EOC(value)                   (DACC_IDR_EOC_Msk & ((value) << DACC_IDR_EOC_Pos))

/* -------- DACC_IMR : (DACC Offset: 0x2c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Mask of channel 0    */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Mask of channel 1    */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Mask of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Mask of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  struct
  {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Mask of channel x    */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Mask of channel x */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_IMR_bits_t;

