zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/dacc.h
#define DACC_IMR_TXRDY0_Pos                   (0)                                            /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 0 Position */
#define DACC_IMR_TXRDY0_Msk                   (0x1U << DACC_IMR_TXRDY0_Pos)                  /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 0 Mask */
#define DACC_IMR_TXRDY1_Pos                   (1)                                            /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 1 Position */
#define DACC_IMR_TXRDY1_Msk                   (0x1U << DACC_IMR_TXRDY1_Pos)                  /**< (DACC_IMR) Transmit Ready Interrupt Mask of channel 1 Mask */
#define DACC_IMR_EOC0_Pos                     (4)                                            /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 0 Position */
#define DACC_IMR_EOC0_Msk                     (0x1U << DACC_IMR_EOC0_Pos)                    /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 0 Mask */
#define DACC_IMR_EOC1_Pos                     (5)                                            /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 1 Position */
#define DACC_IMR_EOC1_Msk                     (0x1U << DACC_IMR_EOC1_Pos)                    /**< (DACC_IMR) End of Conversion Interrupt Mask of channel 1 Mask */
#define DACC_IMR_Msk                          (0x00000033UL)                                 /**< (DACC_IMR) Register Mask  */
#define DACC_IMR_TXRDY_Pos                    (0)                                            /**< (DACC_IMR Position) Transmit Ready Interrupt Mask of channel x */
#define DACC_IMR_TXRDY_Msk                    (0x3U << DACC_IMR_TXRDY_Pos)                   /**< (DACC_IMR Mask) TXRDY */
#define DACC_IMR_TXRDY(value)                 (DACC_IMR_TXRDY_Msk & ((value) << DACC_IMR_TXRDY_Pos))
#define DACC_IMR_EOC_Pos                      (4)                                            /**< (DACC_IMR Position) End of Conversion Interrupt Mask of channel x */
#define DACC_IMR_EOC_Msk                      (0x3U << DACC_IMR_EOC_Pos)                     /**< (DACC_IMR Mask) EOC */
#define DACC_IMR_EOC(value)                   (DACC_IMR_EOC_Msk & ((value) << DACC_IMR_EOC_Pos))

/* -------- DACC_ISR : (DACC Offset: 0x30) (R/ 32) Interrupt Status Register -------- */

typedef union
{
  struct
  {
    uint32_t TXRDY0:1;                  /**< bit:      0  Transmit Ready Interrupt Flag of channel 0    */
    uint32_t TXRDY1:1;                  /**< bit:      1  Transmit Ready Interrupt Flag of channel 1    */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC0:1;                    /**< bit:      4  End of Conversion Interrupt Flag of channel 0 */
    uint32_t EOC1:1;                    /**< bit:      5  End of Conversion Interrupt Flag of channel 1 */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  struct
  {
    uint32_t TXRDY:2;                   /**< bit:   0..1  Transmit Ready Interrupt Flag of channel x    */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t EOC:2;                     /**< bit:   4..5  End of Conversion Interrupt Flag of channel x */
    uint32_t :26;                       /**< bit:  6..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_ISR_bits_t;

#define DACC_ISR_TXRDY0_Pos                   (0)                                            /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 0 Position */
#define DACC_ISR_TXRDY0_Msk                   (0x1U << DACC_ISR_TXRDY0_Pos)                  /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 0 Mask */
#define DACC_ISR_TXRDY1_Pos                   (1)                                            /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 1 Position */
#define DACC_ISR_TXRDY1_Msk                   (0x1U << DACC_ISR_TXRDY1_Pos)                  /**< (DACC_ISR) Transmit Ready Interrupt Flag of channel 1 Mask */
#define DACC_ISR_EOC0_Pos                     (4)                                            /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 0 Position */
#define DACC_ISR_EOC0_Msk                     (0x1U << DACC_ISR_EOC0_Pos)                    /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 0 Mask */
#define DACC_ISR_EOC1_Pos                     (5)                                            /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 1 Position */
#define DACC_ISR_EOC1_Msk                     (0x1U << DACC_ISR_EOC1_Pos)                    /**< (DACC_ISR) End of Conversion Interrupt Flag of channel 1 Mask */
#define DACC_ISR_Msk                          (0x00000033UL)                                 /**< (DACC_ISR) Register Mask  */
#define DACC_ISR_TXRDY_Pos                    (0)                                            /**< (DACC_ISR Position) Transmit Ready Interrupt Flag of channel x */
#define DACC_ISR_TXRDY_Msk                    (0x3U << DACC_ISR_TXRDY_Pos)                   /**< (DACC_ISR Mask) TXRDY */
#define DACC_ISR_TXRDY(value)                 (DACC_ISR_TXRDY_Msk & ((value) << DACC_ISR_TXRDY_Pos))
#define DACC_ISR_EOC_Pos                      (4)                                            /**< (DACC_ISR Position) End of Conversion Interrupt Flag of channel x */
#define DACC_ISR_EOC_Msk                      (0x3U << DACC_ISR_EOC_Pos)                     /**< (DACC_ISR Mask) EOC */
#define DACC_ISR_EOC(value)                   (DACC_ISR_EOC_Msk & ((value) << DACC_ISR_EOC_Pos))

/* -------- DACC_ACR : (DACC Offset: 0x94) (R/W 32) Analog Current Register -------- */

typedef union
{
  struct
  {
    uint32_t IBCTLCH0:2;                /**< bit:   0..1  Analog Output Current Control                 */
    uint32_t IBCTLCH1:2;                /**< bit:   2..3  Analog Output Current Control                 */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_ACR_bits_t;

#define DACC_ACR_IBCTLCH0_Pos                 (0)                                            /**< (DACC_ACR) Analog Output Current Control Position */
#define DACC_ACR_IBCTLCH0_Msk                 (0x3U << DACC_ACR_IBCTLCH0_Pos)                /**< (DACC_ACR) Analog Output Current Control Mask */
#define DACC_ACR_IBCTLCH0(value)              (DACC_ACR_IBCTLCH0_Msk & ((value) << DACC_ACR_IBCTLCH0_Pos))
#define DACC_ACR_IBCTLCH1_Pos                 (2)                                            /**< (DACC_ACR) Analog Output Current Control Position */
#define DACC_ACR_IBCTLCH1_Msk                 (0x3U << DACC_ACR_IBCTLCH1_Pos)                /**< (DACC_ACR) Analog Output Current Control Mask */
#define DACC_ACR_IBCTLCH1(value)              (DACC_ACR_IBCTLCH1_Msk & ((value) << DACC_ACR_IBCTLCH1_Pos))
#define DACC_ACR_Msk                          (0x0000000FUL)                                 /**< (DACC_ACR) Register Mask  */

