zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/dacc.h
/* -------- DACC_WPMR : (DACC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protect Key                             */
  };
  uint32_t w;
} __DACC_WPMR_bits_t;

#define DACC_WPMR_WPEN_Pos                    (0)                                            /**< (DACC_WPMR) Write Protection Enable Position */
#define DACC_WPMR_WPEN_Msk                    (0x1U << DACC_WPMR_WPEN_Pos)                   /**< (DACC_WPMR) Write Protection Enable Mask */
#define DACC_WPMR_WPKEY_Pos                   (8)                                            /**< (DACC_WPMR) Write Protect Key Position */
#define DACC_WPMR_WPKEY_Msk                   (0xFFFFFFU << DACC_WPMR_WPKEY_Pos)             /**< (DACC_WPMR) Write Protect Key Mask */
#define DACC_WPMR_WPKEY(value)                (DACC_WPMR_WPKEY_Msk & ((value) << DACC_WPMR_WPKEY_Pos))
#define   DACC_WPMR_WPKEY_PASSWD_Val          (0x444143U)                                    /**< (DACC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.  */
#define DACC_WPMR_WPKEY_PASSWD                (DACC_WPMR_WPKEY_PASSWD_Val << DACC_WPMR_WPKEY_Pos)  /**< (DACC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0. Position  */
#define DACC_WPMR_Msk                         (0xFFFFFF01UL)                                 /**< (DACC_WPMR) Register Mask  */

/* -------- DACC_WPSR : (DACC Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:8;                  /**< bit:  8..15  Write Protection Violation Source             */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __DACC_WPSR_bits_t;

#define DACC_WPSR_WPVS_Pos                    (0)                                            /**< (DACC_WPSR) Write Protection Violation Status Position */
#define DACC_WPSR_WPVS_Msk                    (0x1U << DACC_WPSR_WPVS_Pos)                   /**< (DACC_WPSR) Write Protection Violation Status Mask */
#define DACC_WPSR_WPVSRC_Pos                  (8)                                            /**< (DACC_WPSR) Write Protection Violation Source Position */
#define DACC_WPSR_WPVSRC_Msk                  (0xFFU << DACC_WPSR_WPVSRC_Pos)                /**< (DACC_WPSR) Write Protection Violation Source Mask */
#define DACC_WPSR_WPVSRC(value)               (DACC_WPSR_WPVSRC_Msk & ((value) << DACC_WPSR_WPVSRC_Pos))
#define DACC_WPSR_Msk                         (0x0000FF01UL)                                 /**< (DACC_WPSR) Register Mask  */

/** \brief DACC register offsets definitions */
#define DACC_CR_OFFSET               (0x00)         /**< (DACC_CR) Control Register Offset */
#define DACC_MR_OFFSET               (0x04)         /**< (DACC_MR) Mode Register Offset */
#define DACC_TRIGR_OFFSET            (0x08)         /**< (DACC_TRIGR) Trigger Register Offset */
#define DACC_CHER_OFFSET             (0x10)         /**< (DACC_CHER) Channel Enable Register Offset */
#define DACC_CHDR_OFFSET             (0x14)         /**< (DACC_CHDR) Channel Disable Register Offset */
#define DACC_CHSR_OFFSET             (0x18)         /**< (DACC_CHSR) Channel Status Register Offset */
#define DACC_CDR_OFFSET              (0x1C)         /**< (DACC_CDR) Conversion Data Register 0 Offset */
#define DACC_IER_OFFSET              (0x24)         /**< (DACC_IER) Interrupt Enable Register Offset */
#define DACC_IDR_OFFSET              (0x28)         /**< (DACC_IDR) Interrupt Disable Register Offset */
#define DACC_IMR_OFFSET              (0x2C)         /**< (DACC_IMR) Interrupt Mask Register Offset */
#define DACC_ISR_OFFSET              (0x30)         /**< (DACC_ISR) Interrupt Status Register Offset */
#define DACC_ACR_OFFSET              (0x94)         /**< (DACC_ACR) Analog Current Register Offset */
#define DACC_WPMR_OFFSET             (0xE4)         /**< (DACC_WPMR) Write Protection Mode Register Offset */
#define DACC_WPSR_OFFSET             (0xE8)         /**< (DACC_WPSR) Write Protection Status Register Offset */

/** \brief DACC register API structure */
typedef struct
{
  __O   __DACC_CR_bits_t               DACC_CR;       /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __DACC_MR_bits_t               DACC_MR;       /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  __DACC_TRIGR_bits_t            DACC_TRIGR;    /**< Offset: 0x08 (R/W  32) Trigger Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   __DACC_CHER_bits_t             DACC_CHER;     /**< Offset: 0x10 ( /W  32) Channel Enable Register */
  __O   __DACC_CHDR_bits_t             DACC_CHDR;     /**< Offset: 0x14 ( /W  32) Channel Disable Register */
  __I   __DACC_CHSR_bits_t             DACC_CHSR;     /**< Offset: 0x18 (R/   32) Channel Status Register */
  __O   __DACC_CDR_bits_t              DACC_CDR[2];   /**< Offset: 0x1C ( /W  32) Conversion Data Register 0 */
  __O   __DACC_IER_bits_t              DACC_IER;      /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O   __DACC_IDR_bits_t              DACC_IDR;      /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I   __DACC_IMR_bits_t              DACC_IMR;      /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I   __DACC_ISR_bits_t              DACC_ISR;      /**< Offset: 0x30 (R/   32) Interrupt Status Register */
  __I   uint8_t                        Reserved2[0x60];
  __IO  __DACC_ACR_bits_t              DACC_ACR;      /**< Offset: 0x94 (R/W  32) Analog Current Register */
  __I   uint8_t                        Reserved3[0x4C];
  __IO  __DACC_WPMR_bits_t             DACC_WPMR;     /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __DACC_WPSR_bits_t             DACC_WPSR;     /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} dacc_registers_t;
/** @}  end of Digital-to-Analog Converter Controller */

#endif /* _PIC32CZ_CA70_DACC_COMPONENT_H_ */
